code.org
#+PROPERTY: header-args: :comments both
#+PROPERTY: header-args:bash :eval no-export :noweb yes :session CCI
#+PROPERTY: header-args:python :eval no-export :noweb yes :session CCI :kernel sci
#+PROPERTY: header-args: :session CCI

* README                                                :noexport:

This document is an Emacs Org Mode plain-text file with code and text embedded.
The purpose of the code is to calculate the mass flux ice discharge (MFID) for ESA CCI+ Greenland, Phase 2.
It is based on the work flow created by Ken Mankoff for the PROMICE Solid Ice Discharge product: Mankoff, Ken; Solgaard, Anne; Larsen, Signe, 2020, "Greenland Ice Sheet solid ice discharge from 1986 through last month: Discharge", https://doi.org/10.22008/promice/data/ice_discharge/d/v02, GEUS Dataverse, V101,
and the previous phases of ESA CCI.

** Workflow

To recreate this work

+ check that you have the necessary software dependencies installed. See section: [[*Code][Code]].
  + In Phase 2 the code was updated to partly run via a docker image limiting the required software packages.
  + Much the code can be run via a Makefile which uses docker - requires docker is installed and a user is logged in
+ Download and set up the necessary data files used throughout the [[*Input data][Input data]] section.
+ Make sure to define DATADIR: (for example: export DATADIR=/mnt/netapp/glaciologi/MFID_ESA_CCI/data)
+ Open this file in Emacs Org Mode.
+ Tangle the embedded code blocks.
+ Execute =make= to run the contents of the [[#sec:makefile][Makefile]].

* Code                                                  :noexport:
:PROPERTIES:
:header-args:bash+: :comments both
:header-args:bash+: :tangle-mode (identity #o744)
:header-args:bash+: :shebang #!/usr/bin/env bash
:END:

** Docker
*** GRASS
:PROPERTIES:
:header-args:docker: :eval no
:END:
**** Dockerfile

#+BEGIN_SRC docker :tangle docker/grass/Dockerfile :mkdirp docker/grass
FROM ubuntu:20.04

LABEL authors="Signe Hillerup Larsen"
LABEL maintainer="shl@geus.dk"

# system environment
ENV DEBIAN_FRONTEND noninteractive

RUN apt-get -y update && apt-get install -y --no-install-recommends --no-install-suggests \
      bc \
      bsdmainutils \
      datamash \
      gdal-bin \
      grass \
      netcdf-bin \
      parallel \
      proj-bin \
      proj-data \
      zip \
      nco \
  && apt-get autoremove -y \
  && apt-get clean -y \ 
  && rm -rf /var/lib/apt/lists/*

RUN echo LANG="en_US.UTF-8" > /etc/default/locale

ENV LANGUAGE en_US.UTF-8
ENV LANG C
ENV LC_ALL C
ENV LC_CTYPE C

ENV SHELL /bin/bash

# create a user
RUN useradd --create-home user && chmod a+rwx /home/user
ENV HOME /home/user
WORKDIR /home/user

RUN mkdir -p /data
ENV DATADIR /data

# switch the user
USER user

CMD ["/usr/bin/grass", "--version"]
#+END_SRC

**** Build
#+BEGIN_SRC bash
# docker build -f Dockerfile_grass -t ice_discharge_grass .
cd docker/grass
docker build -t ice_discharge_grass .
docker run -it ice_discharge_grass # run it
#+END_SRC

**** Test

#+BEGIN_SRC bash
#container_args ?= run -it --cpus 7 --user $(shell id -u):$(shell id -g) --mount type=bind,src=$${DATADIR},dst=/data --mount type=bind,src=$(shell pwd),dst=/work --env PARALLEL="--delay 0.1" ice_discharge_grass
#+END_SRC

**** Deploy

#+BEGIN_SRC bash
# docker tag local-image:tagname new-repo:tagname
docker tag ice_discharge_grass hillerup/ice_discharge:grass
docker push hillerup/ice_discharge:grass
#+END_SRC


*** Python
:PROPERTIES:
:header-args:docker: :eval no
:END:

**** Dockerfile and supporting files

#+BEGIN_SRC docker :tangle docker/conda/Dockerfile :mkdirp docker/conda
FROM continuumio/miniconda3

RUN conda install \
  curl \
  cython \
  ipython \
  jupyter \
  matplotlib \
  numpy \
  pandas \
  pip \
  scipy \
  statsmodels \
  tabulate \
  xarray \
  && conda clean -a \
  && pip install --no-cache-dir \
  cfchecker \
  cfunits \
  grass-session \
  nc-time-axis \
  pyshp \
  semver \
  uncertainties \
  git+https://github.com/aussda/pyDataverse.git@3b040ff23b665ec2650bebcf4bd5478de6881af0

# create a user
RUN useradd --create-home user && chmod a+rwx /home/user
ENV HOME /home/user
WORKDIR /home/user

RUN mkdir -p /data
ENV DATADIR /data

# switch the user
USER user


# create a user
# RUN useradd -m -U user

# RUN chmod a+rwx /home/user
# ENV HOME /home/user
# RUN mkdir -p /data /work
# WORKDIR /work

# switch the user
# USER user

# RUN mkdir -p /data /work
# WORKDIR /work

# The code to run when container is started:
# ENTRYPOINT ["conda", "run", "-n", "ice_discharge", "python3"]

# For interactive shell
# RUN conda init bash
# RUN echo "conda activate ice_discharge" >> /root/.bashrc
#+END_SRC

**** Build
#+BEGIN_SRC bash
cd docker/conda
dockyer build -t ice_discharge_conda .
docker tag ice_discharge_conda:latest hillerup/ice_discharge:conda
docker run -it --mount type=bind,src=$(pwd),dst=/work hillerup/ice_discharge:conda python -c 'import pandas as pd; print(pd)'
#+END_SRC

**** Deploy

#+BEGIN_SRC bash
# docker tag local-image:tagname new-repo:tagname
docker tag ice_discharge_conda hillerup/ice_discharge:conda
docker push hillerup/ice_discharge:conda
#+END_SRC

**** enviroment.yml

It is more reproducible to use the Docker image =mankoff/ice_discharge:conda=, but for record-keeping sake, here is the Python environmnet.

#+BEGIN_SRC bash :results verbatim
docker run hillerup/ice_discharge:conda conda env export -n base
#+END_SRC

#+RESULTS:




** Makefile
:PROPERTIES:
:CUSTOM_ID: sec:makefile
:END:

This code, and all code files in this project, are derived products tangled from the ice_discharge.org source file.

#+BEGIN_SRC makefile :tangle Makefile
container_cmd ?= docker
container_args ?= run --user $(shell id -u):$(shell id -g) --mount type=bind,src=${DATADIR},dst=/data --mount type=bind,src=$(shell pwd),dst=/home/user --env PARALLEL="--delay 0.1 -j -1"


all: docker G GRASS PYTHON dist


docker: FORCE ## Pull down Docker environment
	docker pull hillerup/ice_discharge:grass
	${container_cmd} ${container_args} hillerup/ice_discharge:grass
	docker pull hillerup/ice_discharge:conda
	${container_cmd} ${container_args} hillerup/ice_discharge:conda conda env export -n base


G:
	grass -e -c EPSG:3413 ./G


import: FORCE
	${container_cmd} ${container_args} hillerup/ice_discharge:grass grass ./G/PERMANENT --exec ./import.sh
	
GRASS: FORCE
	${container_cmd} ${container_args} hillerup/ice_discharge:grass grass ./G/PERMANENT --exec ./import.sh
	${container_cmd} ${container_args} hillerup/ice_discharge:grass grass ./G/PERMANENT --exec ./gate_IO_runner.sh
	${container_cmd} ${container_args} hillerup/ice_discharge:grass grass ./G/PERMANENT --exec ./vel_eff.sh
	${container_cmd} ${container_args} hillerup/ice_discharge:grass grass ./G/PERMANENT --exec ./export.sh


PYTHON: FORCE
	${container_cmd} ${container_args} hillerup/ice_discharge:conda python ./errors.py
	${container_cmd} ${container_args} hillerup/ice_discharge:conda python ./raw2discharge.py
	${container_cmd} ${container_args} hillerup/ice_discharge:grass grass ./G/PERMANENT --exec ./gate_export.sh
	mkdir -p figs
	${container_cmd} ${container_args} hillerup/ice_discharge:conda python ./figures.py

dist:
	ln -s out CCI
	zip -r CCI.zip CCI
	rm CCI

FORCE: # dummy target

clean:
	rm -fR G tmp out figs CCI.zip
#+END_SRC
#+RESULTS:
: 
: 81-Ubuntu SMP Tue Nov 26 12:20:02 UTC 2019 x86_64 x86_64 x86_64 GNU/Linux



** Misc Helper
*** Support pretty messages
#+NAME: MSGS_pretty_print
#+BEGIN_SRC bash :results verbatim :tangle no
# Convenience functions for pretty printing messages
RED='\033[0;31m'; ORANGE='\033[0;33m'; GREEN='\033[0;32m'; NC='\033[0m' # No Color
MSG_OK() { echo -e "${GREEN}${@}${NC}"; }
MSG_WARN() { echo -e "${ORANGE}WARNING: ${@}${NC}"; }
MSG_ERR() { echo -e "${RED}ERROR: ${@}${NC}" >&2; }
#+END_SRC
#+RESULTS:

*** GRASS config
https://grass.osgeo.org/grass74/manuals/variables.html
#+BEGIN_SRC sh
#sudo mount -o uid=shl@geus.dk,gid=1260400513 /dev/sda1 /media/shl@geus.dk/datadrive
sudo mount -t ntfs-3g -o uid=1260406986,gid=1260400513 /dev/sda1 /media/shl@geus.dk/datadrive
conda activate py38

grass --text ./G/PERMANENT 



#+END_SRC

#+BEGIN_QUOTE
GRASS_VERBOSE
[all modules]
toggles verbosity level
-1 - complete silence (also errors and warnings are discarded)
0 - only errors and warnings are printed
1 - progress and important messages are printed (percent complete)
2 - all module messages are printed
3 - additional verbose messages are printed
#+END_QUOTE

#+NAME: GRASS_config
#+BEGIN_SRC bash :results verbatim :tangle no
export GRASS_VERBOSE=3
# export GRASS_MESSAGE_FORMAT=silent
#export PROJ_LIB=/usr/bin/proj
#export DATADIR=/data #/mnt/netapp/glaciologi/MFID_ESA_CCI/data
if [ -z ${DATADIR+x} ]; then
    echo "DATADIR environment varible is unset."
    echo "Fix with: \"export DATADIR=/path/to/data\""
    exit 255
fi

set -x # print commands to STDOUT before running them
#+END_SRC
#+RESULTS:





** Import Data
:PROPERTIES:
:header-args:bash+: :tangle import.sh
:END:

#+BEGIN_SRC bash :results verbatim
<<MSGS_pretty_print>>
<<GRASS_config>>
#+END_SRC
#+RESULTS:

*** Bed and Surface
**** BedMachine v5
+ from [[textcite:Morlighem:2017BedMachine][Morlighem /et al./ (2017)]]
#+BEGIN_SRC bash :results verbatim
MSG_OK "BedMachine"
g.mapset -c BedMachine

#for var in $(echo mask surface thickness bed errbed); do
#  echo $var
#  r.external source=netCDF:${DATADIR}/Morlighem_2017/BedMachineGreenland-v5.nc:${var} output=${var}
#done

for var in surface thickness bed errbed; do
  echo $var
  r.external source="${DATADIR}"/Morlighem_2022/BMv5_3413/${var}.tif output=${var} --o
done
echo $var
r.external source="${DATADIR}"/Morlighem_2022/BMv5_3413/mask_float.tif output=mask -o --o

r.colors -a map=errbed color=haxby

g.mapset PERMANENT
g.region raster=surface@BedMachine res=200 -a -p
g.region -s
g.mapset BedMachine
g.region -dp

r.colors map=mask color=haxby

r.mapcalc "mask_ice = if(mask == 2, 1, null())"
#+END_SRC
#+RESULTS:
