code.org
**** Data Intro
:PROPERTIES:
:header-args:bash+: :session ENVEO_provenance
:END:

#+BEGIN_SRC bash :results verbatim :tangle no
# export DATADIR="/media/shl@geus.dk/datadrive/data/ESA_GIS_CCI"
DIR=${DATADIR}/ENVEO/monthly
(cd ${DIR}; ls -FGhol --color *nc)
#+END_SRC

#+RESULTS:
#+begin_example
-rwxrwxrwx 1 shl@geus.dk  50M May 15  2023 greenland_iv_250m_s1_s20141001_e20141031_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk  50M May 15  2023 greenland_iv_250m_s1_s20141101_e20141130_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk  61M May 15  2023 greenland_iv_250m_s1_s20141201_e20141231_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 462M May 15  2023 greenland_iv_250m_s1_s20150101_e20150131_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 512M May 15  2023 greenland_iv_250m_s1_s20150201_e20150228_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 145M May 15  2023 greenland_iv_250m_s1_s20150301_e20150331_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk  55M May 15  2023 greenland_iv_250m_s1_s20150401_e20150430_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 196M May 15  2023 greenland_iv_250m_s1_s20150501_e20150531_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 273M May 15  2023 greenland_iv_250m_s1_s20150601_e20150630_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 271M May 15  2023 greenland_iv_250m_s1_s20150701_e20150731_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 334M May 15  2023 greenland_iv_250m_s1_s20150801_e20150831_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 290M May 15  2023 greenland_iv_250m_s1_s20150901_e20150930_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 271M May 15  2023 greenland_iv_250m_s1_s20151001_e20151031_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 322M May 15  2023 greenland_iv_250m_s1_s20151101_e20151130_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 494M May 15  2023 greenland_iv_250m_s1_s20151201_e20151231_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 559M May 15  2023 greenland_iv_250m_s1_s20160101_e20160131_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 580M May 15  2023 greenland_iv_250m_s1_s20160201_e20160229_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 527M May 15  2023 greenland_iv_250m_s1_s20160301_e20160331_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 451M May 15  2023 greenland_iv_250m_s1_s20160401_e20160430_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 438M May 15  2023 greenland_iv_250m_s1_s20160501_e20160531_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 358M May 15  2023 greenland_iv_250m_s1_s20160601_e20160630_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 333M May 15  2023 greenland_iv_250m_s1_s20160701_e20160731_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 363M May 15  2023 greenland_iv_250m_s1_s20160801_e20160831_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 412M May 15  2023 greenland_iv_250m_s1_s20160901_e20160930_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 411M May 15  2023 greenland_iv_250m_s1_s20161001_e20161031_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 411M May 15  2023 greenland_iv_250m_s1_s20161101_e20161130_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 531M May 15  2023 greenland_iv_250m_s1_s20161201_e20161231_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 593M May 15  2023 greenland_iv_250m_s1_s20170101_e20170131_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 527M May 15  2023 greenland_iv_250m_s1_s20170201_e20170228_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 460M May 15  2023 greenland_iv_250m_s1_s20170301_e20170331_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 449M May 15  2023 greenland_iv_250m_s1_s20170401_e20170430_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 449M May 15  2023 greenland_iv_250m_s1_s20170501_e20170531_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 439M May 15  2023 greenland_iv_250m_s1_s20170601_e20170630_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 429M May 15  2023 greenland_iv_250m_s1_s20170701_e20170731_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 427M May 15  2023 greenland_iv_250m_s1_s20170801_e20170831_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 433M May 15  2023 greenland_iv_250m_s1_s20170901_e20170930_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 437M May 15  2023 greenland_iv_250m_s1_s20171001_e20171031_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 436M May 15  2023 greenland_iv_250m_s1_s20171101_e20171130_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 546M May 15  2023 greenland_iv_250m_s1_s20171201_e20171231_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 564M May 15  2023 greenland_iv_250m_s1_s20180101_e20180131_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 562M May 15  2023 greenland_iv_250m_s1_s20180201_e20180228_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 525M May 15  2023 greenland_iv_250m_s1_s20180301_e20180331_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 511M May 15  2023 greenland_iv_250m_s1_s20180401_e20180430_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 445M May 15  2023 greenland_iv_250m_s1_s20180501_e20180531_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 432M May 15  2023 greenland_iv_250m_s1_s20180601_e20180630_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 415M May 15  2023 greenland_iv_250m_s1_s20180701_e20180731_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 418M May 15  2023 greenland_iv_250m_s1_s20180801_e20180831_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 422M May 15  2023 greenland_iv_250m_s1_s20180901_e20180930_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 431M May 15  2023 greenland_iv_250m_s1_s20181001_e20181031_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 435M May 15  2023 greenland_iv_250m_s1_s20181101_e20181130_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 567M May 15  2023 greenland_iv_250m_s1_s20181201_e20181231_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 571M May 15  2023 greenland_iv_250m_s1_s20190101_e20190131_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 541M May 15  2023 greenland_iv_250m_s1_s20190201_e20190228_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 499M May 15  2023 greenland_iv_250m_s1_s20190301_e20190331_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 532M May 15  2023 greenland_iv_250m_s1_s20190401_e20190430_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 541M May 15  2023 greenland_iv_250m_s1_s20190501_e20190531_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 453M May 15  2023 greenland_iv_250m_s1_s20190601_e20190630_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 408M May 15  2023 greenland_iv_250m_s1_s20190701_e20190731_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 462M May 15  2023 greenland_iv_250m_s1_s20190801_e20190831_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 469M May 15  2023 greenland_iv_250m_s1_s20190901_e20190930_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 467M May 15  2023 greenland_iv_250m_s1_s20191001_e20191031_v1_2.nc*
-rwxrwxrwx 1 shl@geus.dk 478M May 15  2023 greenland_iv_250m_s1_s20191101_e20191130_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 564M May 15  2023 greenland_iv_250m_s1_s20191201_e20191231_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 580M May 15  2023 greenland_iv_250m_s1_s20200101_e20200131_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 515M May 15  2023 greenland_iv_250m_s1_s20200201_e20200229_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 512M May 15  2023 greenland_iv_250m_s1_s20200301_e20200331_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 448M May 15  2023 greenland_iv_250m_s1_s20200401_e20200430_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 452M May 15  2023 greenland_iv_250m_s1_s20200501_e20200531_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 445M May 15  2023 greenland_iv_250m_s1_s20200601_e20200630_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 410M May 15  2023 greenland_iv_250m_s1_s20200701_e20200731_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 429M May 15  2023 greenland_iv_250m_s1_s20200801_e20200831_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 544M May 15  2023 greenland_iv_250m_s1_s20200901_e20200930_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 520M May 15  2023 greenland_iv_250m_s1_s20201001_e20201031_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 585M May 15  2023 greenland_iv_250m_s1_s20201101_e20201130_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 644M May 15  2023 greenland_iv_250m_s1_s20201201_e20201231_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 645M May 15  2023 greenland_iv_250m_s1_s20210101_e20210131_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 568M May 15  2023 greenland_iv_250m_s1_s20210201_e20210228_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 499M May 15  2023 greenland_iv_250m_s1_s20210301_e20210331_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 529M May 15  2023 greenland_iv_250m_s1_s20210401_e20210430_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 501M May 15  2023 greenland_iv_250m_s1_s20210501_e20210531_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 487M May 15  2023 greenland_iv_250m_s1_s20210601_e20210630_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 425M May 15  2023 greenland_iv_250m_s1_s20210701_e20210731_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 460M May 15  2023 greenland_iv_250m_s1_s20210801_e20210831_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 493M May 15  2023 greenland_iv_250m_s1_s20210901_e20210930_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 506M May 15  2023 greenland_iv_250m_s1_s20211001_e20211031_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 541M May 15  2023 greenland_iv_250m_s1_s20211101_e20211130_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 631M May 15  2023 greenland_iv_250m_s1_s20211201_e20211231_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 626M May 15  2023 greenland_iv_250m_s1_s20220101_e20220131_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 561M May 15  2023 greenland_iv_250m_s1_s20220201_e20220228_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 553M May 15  2023 greenland_iv_250m_s1_s20220301_e20220331_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 476M May 15  2023 greenland_iv_250m_s1_s20220401_e20220430_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 471M May 15  2023 greenland_iv_250m_s1_s20220501_e20220531_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 429M May 15  2023 greenland_iv_250m_s1_s20220601_e20220630_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 417M May 15  2023 greenland_iv_250m_s1_s20220701_e20220731_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 418M May 15  2023 greenland_iv_250m_s1_s20220801_e20220831_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 385M May 15  2023 greenland_iv_250m_s1_s20220901_e20220930_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 405M May 15  2023 greenland_iv_250m_s1_s20221001_e20221031_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 428M May 15  2023 greenland_iv_250m_s1_s20221101_e20221130_v1_3.nc*
-rwxrwxrwx 1 shl@geus.dk 463M May 15  2023 greenland_iv_250m_s1_s20221201_e20221231_v1_3.nc*
#+end_example
 
#+BEGIN_SRC bash :results verbatim :tangle no
(cd ${DIR}; ncdump -h $(ls *.nc | head -n1))
#+END_SRC

#+BEGIN_SRC bash :results table :tangle no
(cd ${DIR}; parallel "md5sum {}" ::: $(ls *.nc|head -n8))
#+END_SRC

#+RESULTS:
| 40d53f823e1a01e393fca2565eff5c1d | greenland_iv_250m_s1_s20141001_e20141031_v1_2.nc |
| ff0b16030be15cff201e5a540ef52848 | greenland_iv_250m_s1_s20141101_e20141130_v1_2.nc |
| 385e0a91654d3db8519ceb615b636436 | greenland_iv_250m_s1_s20150401_e20150430_v1_2.nc |
| e2af090c797fcc4bba8d62cf1933f49c | greenland_iv_250m_s1_s20141201_e20141231_v1_2.nc |
| 420a6f7617e2faefbb24f8afb3d456af | greenland_iv_250m_s1_s20150301_e20150331_v1_2.nc |
| 404ab716763f17524d318614b33bef2b | greenland_iv_250m_s1_s20150501_e20150531_v1_2.nc |
| 2bf634332b30fb6400cb3609fdd8972d | greenland_iv_250m_s1_s20150101_e20150131_v1_2.nc |
| d54cb3333feb08bfaac216f20371ae89 | greenland_iv_250m_s1_s20150201_e20150228_v1_2.nc |

**** Import data
+ Read in all the data
+ Convert from [m day-1] to [m year-1]
#+BEGIN_SRC bash :results verbatim
MSG_OK "ENVEO"
g.mapset -c ENVEO
ROOT=${DATADIR}/ENVEO/monthly

find ${ROOT} -name "*.nc"
# FILE=$(find ${ROOT} -name "*.nc"|head -n1) # testing

FILE=$(find ${ROOT} -name "greenland*.nc" | head -n1) # DEBUG
for FILE in $(find ${ROOT} -name "greenland*.nc" | LC_ALL=C sort); do
  T=$(echo ${FILE}|grep -o _s........_| tr -dc [0-9])
  DATE_STR=${T:0:4}_${T:4:2}_${T:6:2}
  echo $DATE_STR

  r.external -o source="NetCDF:${FILE}:land_ice_surface_easting_velocity" output=vx_${DATE_STR}
  r.external -o source="NetCDF:${FILE}:land_ice_surface_northing_velocity" output=vy_${DATE_STR}

  r.external -o source="NetCDF:${FILE}:land_ice_surface_velocity_stddev" output=err_${DATE_STR}
  r.external -o source="NetCDF:${FILE}:land_ice_surface_easting_stddev" output=ex_${DATE_STR}
  r.external -o source="NetCDF:${FILE}:land_ice_surface_northing_stddev" output=ey_${DATE_STR}
  r.mapcalc "err_${DATE_STR} = (ex_${DATE_STR}^2 + ey_${DATE_STR}^2)^0.5"
done

FILE=$(find ${ROOT} -name "*CCI*.nc" | head -n1) # DEBUG
for FILE in $(find ${ROOT} -name "*CCI*.nc" | LC_ALL=C sort); do
  T=$(basename "${FILE}" | grep -o '^[0-9]\{8\}')

  DATE_STR=${T:0:4}_${T:4:2}_${T:6:2}
  echo $DATE_STR

  r.external -o source="NetCDF:${FILE}:land_ice_surface_easting_velocity" output=vx_${DATE_STR}
  r.external -o source="NetCDF:${FILE}:land_ice_surface_northing_velocity" output=vy_${DATE_STR}

  r.external -o source="NetCDF:${FILE}:land_ice_surface_velocity_stddev" output=err_${DATE_STR}
  r.external -o source="NetCDF:${FILE}:land_ice_surface_easting_stddev" output=ex_${DATE_STR}
  r.external -o source="NetCDF:${FILE}:land_ice_surface_northing_stddev" output=ey_${DATE_STR}
  r.mapcalc "err_${DATE_STR} = (ex_${DATE_STR}^2 + ey_${DATE_STR}^2)^0.5"
done
#+END_SRC
#+RESULTS:

**** Find baseline
#+BEGIN_SRC bash :results verbatim
r.series input=$(g.list type=raster pattern=vx_2018_* separator=",") output=vx_baseline method=average --o
r.series input=$(g.list type=raster pattern=vy_2018_* separator=",") output=vy_baseline method=average --o
r.mapcalc "vel_baseline = 365 * sqrt(vx_baseline^2 + vy_baseline^2) * mask_ice@BedMachine" --o

r.series input=$(g.list type=raster pattern=err_2018_* separator=",") output=err_baseline method=average --o
r.mapcalc "vel_err_baseline = 365 * err_baseline * mask_ice@BedMachine" --o
#+END_SRC
#+RESULTS:

