scripts/import.sh
# Find baseline:1 ends here

# Fill in holes
# + There are holes in the velocity data which will create false gates. Fill them in.
# + Clump based on yes/no velocity
#   + Largest clump is GIS
#   + 2nd largest is ocean
# + Mask by ocean (so velocity w/ holes remains)
# + Fill holes

# [[file:code.org::*Fill in holes][Fill in holes:1]]
r.mask -r
r.mapcalc "no_vel = if(isnull(vel_baseline), 1, null())"
r.mask no_vel
r.clump input=no_vel output=no_vel_clump --o
ocean_clump=$(r.stats -c -n no_vel_clump sort=desc | head -n1 | cut -d" " -f1)
r.mask -i raster=no_vel_clump maskcats=${ocean_clump} --o
r.fillnulls input=vel_baseline out=vel_baseline_filled method=bilinear
r.mask -r
g.rename raster=vel_baseline_filled,vel_baseline --o
r.colors map=vel_baseline -e color=viridis
