code.org
**** Data Intro
:PROPERTIES:
:header-args:bash+: :session Sentinel_provenance
:END:

#+BEGIN_SRC bash :results verbatim :tangle no
DIR=${DATADIR}/Sentinel1/Sentinel1_IV_maps
(cd ${DIR}; nth *.nc)
#+END_SRC

#+RESULTS:
#+begin_example

-rw------- 1 kdm  96M Nov 16  2017 IV_20160913_20161006.nc
-rw------- 1 kdm  97M Nov 16  2017 IV_20160925_20161018.nc
-rw------- 1 kdm  88M Nov 16  2017 IV_20161007_20161030.nc
-rw------- 1 kdm  88M Nov 16  2017 IV_20161013_20161105.nc
-rw------- 1 kdm  71M Nov 16  2017 IV_20161019_20161111.nc
-rw------- 1 kdm  83M Nov 16  2017 IV_20161031_20161123.nc
-rw------- 1 kdm  80M Nov 16  2017 IV_20161106_20161129.nc
-rw------- 1 kdm  87K Nov 16  2017 IV_20161118_20161211.nc
-rw------- 1 kdm  87K Nov 16  2017 IV_20161124_20161217.nc
-rw------- 1 kdm 100M Nov 16  2017 IV_20161130_20161223.nc
-rw------- 1 kdm  99M Nov 16  2017 IV_20161206_20161229.nc
-rw------- 1 kdm 101M Nov 16  2017 IV_20161212_20170104.nc
-rw------- 1 kdm 126M Nov 16  2017 IV_20161218_20170110.nc
-rw------- 1 kdm 133M Nov 16  2017 IV_20161224_20170116.nc
-rw------- 1 kdm 140M Nov 16  2017 IV_20161230_20170122.nc
-rw------- 1 kdm 141M Nov 16  2017 IV_20170105_20170128.nc
-rw------- 1 kdm 118M Nov 16  2017 IV_20170111_20170203.nc
-rw------- 1 kdm 112M Nov 16  2017 IV_20170117_20170209.nc
-rw------- 1 kdm 124M Nov 16  2017 IV_20170123_20170215.nc
-rw------- 1 kdm 123M Nov 16  2017 IV_20170129_20170221.nc
-rw------- 1 kdm 125M Nov 16  2017 IV_20170204_20170227.nc
-rw------- 1 kdm 125M Nov 16  2017 IV_20170210_20170305.nc
-rw------- 1 kdm 104M Nov 16  2017 IV_20170216_20170311.nc
-rw------- 1 kdm 105M Nov 16  2017 IV_20170222_20170317.nc
-rw------- 1 kdm 106M Nov 16  2017 IV_20170228_20170323.nc
-rw------- 1 kdm 104M Nov 16  2017 IV_20170306_20170329.nc
-rw------- 1 kdm 105M Nov 16  2017 IV_20170312_20170404.nc
-rw------- 1 kdm 105M Nov 16  2017 IV_20170318_20170410.nc
-rw------- 1 kdm 109M Nov 16  2017 IV_20170324_20170416.nc
-rw------- 1 kdm 106M Nov 16  2017 IV_20170330_20170422.nc
-rw------- 1 kdm 106M Nov 16  2017 IV_20170405_20170428.nc
-rw------- 1 kdm  99M Nov 16  2017 IV_20170411_20170504.nc
-rw------- 1 kdm  99M Nov 16  2017 IV_20170417_20170510.nc
-rw------- 1 kdm  96M Nov 16  2017 IV_20170423_20170516.nc
-rw------- 1 kdm 101M Nov 16  2017 IV_20170429_20170522.nc
-rw------- 1 kdm 104M Nov 16  2017 IV_20170505_20170528.nc
-rw------- 1 kdm 107M Nov 16  2017 IV_20170511_20170603.nc
-rw------- 1 kdm 108M Nov 16  2017 IV_20170517_20170609.nc
-rw------- 1 kdm 108M Nov 16  2017 IV_20170523_20170615.nc
-rw------- 1 kdm 106M Nov 16  2017 IV_20170529_20170621.nc
-rw------- 1 kdm 105M Nov 16  2017 IV_20170604_20170627.nc
-rw------- 1 kdm 106M Nov 16  2017 IV_20170610_20170703.nc
-rw------- 1 kdm 103M Nov 16  2017 IV_20170616_20170709.nc
-rw------- 1 kdm 101M Nov 16  2017 IV_20170622_20170715.nc
-rw------- 1 kdm 100M Nov 16  2017 IV_20170628_20170721.nc
-rw------- 1 kdm 102M Nov 16  2017 IV_20170704_20170727.nc
-rw------- 1 kdm 100M Nov 16  2017 IV_20170710_20170802.nc
-rw------- 1 kdm  99M Nov 16  2017 IV_20170716_20170808.nc
-rw------- 1 kdm 102M Nov 16  2017 IV_20170722_20170814.nc
-rw------- 1 kdm 106M Nov 16  2017 IV_20170728_20170820.nc
-rw-r--r-- 1 kdm 100M Nov 16  2017 IV_20170803_20170826.nc
-rw-r--r-- 1 kdm 102M Jan 12  2018 IV_20170809_20170901.nc
-rw-r--r-- 1 kdm 102M Jan 12  2018 IV_20170815_20170907.nc
-rw-r--r-- 1 kdm 100M Jan 12  2018 IV_20170821_20170913.nc
-rw-r--r-- 1 kdm  99M Jan 12  2018 IV_20170902_20170925.nc
-rw-r--r-- 1 kdm  99M Jan 12  2018 IV_20170908_20171001.nc
-rw-r--r-- 1 kdm  90M Jan 12  2018 IV_20170914_20171007.nc
-rw-r--r-- 1 kdm 107M Apr  6  2018 IV_20170920_20171013.nc
-rw-r--r-- 1 kdm 109M Apr  6  2018 IV_20170926_20171019.nc
-rw-r--r-- 1 kdm 108M Apr  6  2018 IV_20171002_20171025.nc
-rw-r--r-- 1 kdm 107M Apr 11  2018 IV_20171008_20171031.nc
-rw-r--r-- 1 kdm  97M Apr 11  2018 IV_20171014_20171106.nc
-rw-r--r-- 1 kdm  95M Apr 11  2018 IV_20171020_20171112.nc
-rw-r--r-- 1 kdm 102M Apr 11  2018 IV_20171026_20171118.nc
-rw-r--r-- 1 kdm 104M Apr 11  2018 IV_20171101_20171124.nc
-rw-r--r-- 1 kdm 107M Apr  6  2018 IV_20171106_20171130.nc
-rw-rw-r-- 1 kdm 104M Apr  6  2018 IV_20171118_20171212.nc
-rw-r--r-- 1 kdm 106M Apr  9  2018 IV_20171130_20171224.nc
-rw-r--r-- 1 kdm 113M Apr  9  2018 IV_20171212_20180105.nc
-rw-r--r-- 1 kdm 146M Apr  9  2018 IV_20171224_20180117.nc
-rw-rw-r-- 1 kdm 142M Apr 11  2018 IV_20180105_20180129.nc
-rw-rw-r-- 1 kdm 150M Apr 30  2018 IV_20180117_20180210.nc
-rw-rw-r-- 1 kdm 123M Apr 30  2018 IV_20180129_20180222.nc
-rw-rw-r-- 1 kdm 121M May  3  2018 IV_20180210_20180306.nc
-rw-rw-r-- 1 kdm 132M Aug 24  2018 IV_20180222_20180318.nc
-rw-rw-r-- 1 kdm 125M Aug 24  2018 IV_20180306_20180330.nc
-rw-rw-r-- 1 kdm 120M Aug 24  2018 IV_20180318_20180411.nc
-rw-rw-r-- 1 kdm  87M Aug 24  2018 IV_20180330_20180423.nc
-rw-rw-r-- 1 kdm  69M Aug 24  2018 IV_20180411_20180505.nc
-rw-rw-r-- 1 kdm  88M Aug 24  2018 IV_20180423_20180517.nc
-rw-rw-r-- 1 kdm 103M Aug 28  2018 IV_20180505_20180529.nc
-rw-rw-r-- 1 kdm 100M Sep  3  2018 IV_20180517_20180610.nc
-rw-rw-r-- 1 kdm 108M Nov 22  2018 IV_20180529_20180622.nc
-rw-rw-r-- 1 kdm 108M Nov 22  2018 IV_20180610_20180704.nc
-rw-rw-r-- 1 kdm 101M Nov 22  2018 IV_20180622_20180716.nc
-rw-rw-r-- 1 kdm  85M Nov 22  2018 IV_20180704_20180728.nc
-rw-rw-r-- 1 kdm  90M Nov 23  2018 IV_20180716_20180809.nc
-rw-rw-r-- 1 kdm  99M Nov 23  2018 IV_20180728_20180821.nc
-rw-rw-r-- 1 kdm 106M Nov 23  2018 IV_20180809_20180902.nc
-rw-rw-r-- 1 kdm 100M Nov 23  2018 IV_20180821_20180914.nc
-rw-rw-r-- 1 kdm 110M Nov 23  2018 IV_20180902_20180926.nc
-rw-rw-r-- 1 kdm  89M Nov 23  2018 IV_20180914_20181008.nc
-rw-rw-r-- 1 kdm 106M Feb  8  2019 IV_20180926_20181020.nc
-rw-rw-r-- 1 kdm 109M Feb  8  2019 IV_20181008_20181101.nc
-rw-rw-r-- 1 kdm 110M Feb  8  2019 IV_20181020_20181113.nc
-rw-rw-r-- 1 kdm 111M Feb  8  2019 IV_20181101_20181125.nc
-rw-rw-r-- 1 kdm 110M Feb  8  2019 IV_20181113_20181207.nc
-rw-rw-r-- 1 kdm 109M Feb  8  2019 IV_20181126_20181219.nc
-rw-rw-r-- 1 kdm 130M Feb  8  2019 IV_20181207_20181231.nc
-rw-rw-r-- 1 kdm 142M Apr  5  2019 IV_20181219_20190112.nc
-rw-rw-r-- 1 kdm 143M Apr  5  2019 IV_20181231_20190124.nc
-rw-rw-r-- 1 kdm 148M Apr  5  2019 IV_20190112_20190205.nc
-rw-rw-r-- 1 kdm 116M Apr  5  2019 IV_20190124_20190217.nc
-rw-rw-r-- 1 kdm 133M Apr  8  2019 IV_20190205_20190301.nc
-rw-rw-r-- 1 kdm 126M Apr  8  2019 IV_20190217_20190313.nc
-rw-rw-r-- 1 kdm 113M Apr 11  2019 IV_20190301_20190325.nc
-rw-rw-r-- 1 kdm 110M Apr 23  2019 IV_20190313_20190406.nc
-rw-rw-r-- 1 kdm 127M Apr 30  2019 IV_20190325_20190417.nc
-rw-rw-r-- 1 kdm 134M May  6  2019 IV_20190406_20190430.nc
-rw-rw-r-- 1 kdm 146M May 23  2019 IV_20190418_20190512.nc
-rw-rw-r-- 1 kdm 134M Jun  3  2019 IV_20190430_20190524.nc
-rw-rw-r-- 1 kdm 120M Jun 12  2019 IV_20190512_20190605.nc
-rw-rw-r-- 1 kdm 120M Jun 25  2019 IV_20190524_20190617.nc
-rw-rw-r-- 1 kdm  98M Jul 10  2019 IV_20190605_20190629.nc
-rw-rw-r-- 1 kdm 109M Aug 13  2019 IV_20190617_20190711.nc
-rw-rw-r-- 1 kdm 112M Aug 13  2019 IV_20190629_20190723.nc
-rw-rw-r-- 1 kdm 101M Aug 21  2019 IV_20190711_20190804.nc
-rw-rw-r-- 1 kdm 108M Aug 29  2019 IV_20190723_20190816.nc
-rw-rw-r-- 1 kdm 127M Sep  4 09:46 IV_20190804_20190828.nc
-rw-r--r-- 1 kdm 129M Sep 17 07:59 IV_20190816_20190909.nc
-rw-r--r-- 1 kdm 129M Sep 30 10:46 IV_20190828_20190921.nc
-rw-rw-r-- 1 kdm 116M Oct 11 06:30 IV_20190909_20191003.nc
-rw-rw-r-- 1 kdm 116M Nov  1 07:07 IV_20190921_20191015.nc
-rw-rw-r-- 1 kdm 129M Nov 11 11:53 IV_20191003_20191027.nc
-rw-rw-r-- 1 kdm 125M Nov 18 04:35 IV_20191015_20191108.nc
-rw-rw-r-- 1 kdm 129M Nov 26 11:40 IV_20191027_20191120.nc
-rw-rw-r-- 1 kdm 156M Dec 11 04:01 IV_20191108_20191202.nc
-rw-rw-r-- 1 kdm 159M Dec 20 07:30 IV_20191120_20191214.nc
-rw-rw-r-- 1 kdm 179M Jan  2 20:02 IV_20191202_20191226.nc
-rw-rw-r-- 1 kdm 188M Jan 22 05:30 IV_20191214_20200107.nc
-rw-rw-r-- 1 kdm 187M Jan 31 22:52 IV_20191226_20200119.nc
-rw-rw-r-- 1 kdm 187M Feb 17 14:03 IV_20200107_20200131.nc
-rw-rw-r-- 1 kdm 177M Feb 20 12:46 IV_20200119_20200212.nc
#+end_example
 
#+BEGIN_SRC bash :results verbatim :tangle no
(cd ${DIR}; ncdump -h $(ls *.nc | head -n1))
#+END_SRC
#+RESULTS:
#+begin_example
netcdf greenland_iv_250m_s1_s20141001_e20141031_v1_2 {
dimensions:
	y = 10801 ;
	x = 5984 ;
variables:
	int crs ;
		crs:grid_mapping_name = "polar_stereographic" ;
		crs:standard_parallel = 70. ;
		crs:straight_vertical_longitude_from_pole = -45. ;
		crs:false_easting = 0. ;
		crs:false_northing = 0. ;
		crs:unit = "metre" ;
		crs:spatial_ref = "PROJCS[\"WGS 84 / NSIDC Sea Ice Polar Stereographic North\",\n    GEOGCS[\"WGS 84\",\n        DATUM[\"WGS_1984\",\n            SPHEROID[\"WGS 84\",6378137,298.257223563,\n                AUTHORITY[\"EPSG\",\"7030\"]],\n            AUTHORITY[\"EPSG\",\"6326\"]],\n        PRIMEM[\"Greenwich\",0,\n            AUTHORITY[\"EPSG\",\"8901\"]],\n        UNIT[\"degree\",0.0174532925199433,\n            AUTHORITY[\"EPSG\",\"9122\"]],\n        AUTHORITY[\"EPSG\",\"4326\"]],\n    PROJECTION[\"Polar_Stereographic\"],\n    PARAMETER[\"latitude_of_origin\",70],\n    PARAMETER[\"central_meridian\",-45],\n    PARAMETER[\"scale_factor\",1],\n    PARAMETER[\"false_easting\",0],\n    PARAMETER[\"false_northing\",0],\n    UNIT[\"metre\",1,\n        AUTHORITY[\"EPSG\",\"9001\"]],\n    AXIS[\"X\",EAST],\n    AXIS[\"Y\",NORTH],\n    AUTHORITY[\"EPSG\",\"3413\"]]" ;
		crs:latitude_of_projection_origin = 90. ;
	double y(y) ;
		y:units = "m" ;
		y:axis = "Y" ;
		y:long_name = "y coordinate of projection" ;
		y:standard_name = "projection_y_coordinate" ;
	double x(x) ;
		x:units = "m" ;
		x:axis = "X" ;
		x:long_name = "x coordinate of projection" ;
		x:standard_name = "projection_x_coordinate" ;
	float land_ice_surface_easting_velocity(y, x) ;
		land_ice_surface_easting_velocity:_FillValue = 3.402823e+38f ;
		land_ice_surface_easting_velocity:units = "m/day" ;
		land_ice_surface_easting_velocity:description = "easting ice velocity" ;
		land_ice_surface_easting_velocity:grid_mapping = "crs" ;
		land_ice_surface_easting_velocity:coordinates = "y x" ;
	float land_ice_surface_northing_velocity(y, x) ;
		land_ice_surface_northing_velocity:_FillValue = 3.402823e+38f ;
		land_ice_surface_northing_velocity:units = "m/day" ;
		land_ice_surface_northing_velocity:description = "northing ice velocity" ;
		land_ice_surface_northing_velocity:grid_mapping = "crs" ;
		land_ice_surface_northing_velocity:coordinates = "y x" ;
	float land_ice_surface_vertical_velocity(y, x) ;
		land_ice_surface_vertical_velocity:_FillValue = 3.402823e+38f ;
		land_ice_surface_vertical_velocity:units = "m/day" ;
		land_ice_surface_vertical_velocity:description = "vertical ice velocity" ;
		land_ice_surface_vertical_velocity:grid_mapping = "crs" ;
		land_ice_surface_vertical_velocity:coordinates = "y x" ;
	float land_ice_surface_velocity_magnitude(y, x) ;
		land_ice_surface_velocity_magnitude:_FillValue = 3.402823e+38f ;
		land_ice_surface_velocity_magnitude:units = "m/day" ;
		land_ice_surface_velocity_magnitude:description = "magnitude of horizontal ice velocity" ;
		land_ice_surface_velocity_magnitude:grid_mapping = "crs" ;
		land_ice_surface_velocity_magnitude:coordinates = "y x" ;
	int land_ice_surface_measurement_count(y, x) ;
		land_ice_surface_measurement_count:_FillValue = -1 ;
		land_ice_surface_measurement_count:units = "m/day" ;
		land_ice_surface_measurement_count:description = "count of measurements" ;
		land_ice_surface_measurement_count:grid_mapping = "crs" ;
		land_ice_surface_measurement_count:coordinates = "y x" ;
	float land_ice_surface_velocity_stddev(y, x) ;
		land_ice_surface_velocity_stddev:_FillValue = 3.402823e+38f ;
		land_ice_surface_velocity_stddev:units = "m/day" ;
		land_ice_surface_velocity_stddev:description = "standard deviation of ice velocity" ;
		land_ice_surface_velocity_stddev:grid_mapping = "crs" ;
		land_ice_surface_velocity_stddev:coordinates = "y x" ;

// global attributes:
		:comment = "Ice velocity map of Greenland derived from Sentinel-1 SAR data acquired from 2014-10-01 to 2014-10-31. The surface velocity is derived applying feature tracking techniques. The ice velocity map is provided at 250m grid spacing in North Polar Stereographic projection (EPSG: 3413). The horizontal velocity is provided in true meters per day, towards EASTING(vx) and NORTHING(vy) direction of the grid, and the vertical displacement (vz), is derived from a digital elevation model. Provided is a NetCDF file with the velocity components: vx, vy, vz and vv (magnitude of the horizontal components), along with maps showing valid pixel count and uncertainty (std.). The product was generated by Sentinel." ;
		:contact = "http://www.enveo.at/" ;
		:Conventions = "CF-1.7" ;
		:creation_date = "2020-02-04" ;
		:history = "Initial product version 1.2" ;
		:institution = "Sentinel" ;
		:keywords = "EARTH SCIENCE CLIMATE INDICATORS CRYOSPHERIC INDICATORS GLACIAL MEASUREMENTS ICE SHEET VELOCITY CRYOSPHERE GLACIERS/ICE SHEETS" ;
		:license = "general license" ;
		:project = "ESA Greenland Ice Sheet CCI+" ;
		:reference = "Main: Nagler, T.; Rott, H.; Hetzenecker, M.; Wuite, J.; Potin, P. The Sentinel-1 Mission: New Opportunities for Ice Sheet Observations. Remote Sens. 2015, 7, 9371-9389." ;
		:source = "Copernicus Sentinel-1A and Sentinel-1B" ;
		:summary = "Ice velocity derived for Greenland Ice Sheet gridded at sm averaged from 2014-10-01 to 2014-10-31." ;
		:title = "Ice Velocity of the Greenland Ice Sheet" ;
}
#+end_example

#+BEGIN_SRC bash :results table :tangle no
(cd ${DIR}; parallel "md5sum {}" ::: $(ls *.nc|head -n8))
#+END_SRC

#+RESULTS:
| ff0b16030be15cff201e5a540ef52848 | greenland_iv_250m_s1_s20141101_e20141130_v1_2.nc |
| e2af090c797fcc4bba8d62cf1933f49c | greenland_iv_250m_s1_s20141201_e20141231_v1_2.nc |
| 40d53f823e1a01e393fca2565eff5c1d | greenland_iv_250m_s1_s20141001_e20141031_v1_2.nc |
| 385e0a91654d3db8519ceb615b636436 | greenland_iv_250m_s1_s20150401_e20150430_v1_2.nc |
| 420a6f7617e2faefbb24f8afb3d456af | greenland_iv_250m_s1_s20150301_e20150331_v1_2.nc |
| 404ab716763f17524d318614b33bef2b | greenland_iv_250m_s1_s20150501_e20150531_v1_2.nc |
| 2bf634332b30fb6400cb3609fdd8972d | greenland_iv_250m_s1_s20150101_e20150131_v1_2.nc |
| d54cb3333feb08bfaac216f20371ae89 | greenland_iv_250m_s1_s20150201_e20150228_v1_2.nc |

**** Import data
+ Read in all the data
+ Convert from [m day-1] to [m year-1]
#+BEGIN_SRC bash :results verbatim
MSG_OK "Sentinel 1"
g.mapset -c Sentinel1
ROOT=${DATADIR}/Sentinel1/Sentinel1_IV_maps

find ${ROOT} -name "*.nc"
# FILE=$(find ${ROOT} -name "*.nc"|head -n1) # testing

FILE=$(find ${ROOT} -name "*.nc" | head -n1) # DEBUG
for FILE in $(find ${ROOT} -name "*.nc"); do
  T=$(ncdump -v time $FILE | tail -n2 | tr -dc '[0-9]')
  DATE=$(date --date="1990-01-01 +${T} days" --iso-8601)
  DATE_STR=$(echo ${DATE} | sed s/-/_/g)
  echo $DATE

  r.external -o source="NetCDF:${FILE}:land_ice_surface_easting_velocity" output=vx_${DATE_STR}
  r.external -o source="NetCDF:${FILE}:land_ice_surface_northing_velocity" output=vy_${DATE_STR}
  r.external -o source="NetCDF:${FILE}:land_ice_surface_easting_velocity_std" output=ex_${DATE_STR}
  r.external -o source="NetCDF:${FILE}:land_ice_surface_northing_velocity_std" output=ey_${DATE_STR}
done
#+END_SRC
#+RESULTS:


*** Glacier Names
+ From [[textcite:Bjork:2015Brief][Bjørk /et al./ (2015)]].
+ Also use citet:mouginot_2019_glacier
