code.org
*** Results (Mouginot 2019 Sector)
#+BEGIN_SRC python :results raw drawer :session discharge :display text/org
from uncertainties import unumpy
import pandas as pd
import numpy as np

df = pd.read_csv("./tmp/dat.csv")

err_sector = pd.DataFrame(columns=['D', 'E', 'E%'])
err_sector.index.name = 'Sector'

sectors = np.unique(df['sectors@Mouginot_2019'].values)
for s in sectors:
    sub = df[df['sectors@Mouginot_2019'] == s]
    thick = sub['thickness@BedMachine']
    vel = sub['vel_baseline@ENVEO']
    D = 200  * thick * vel * 917 / 1E12
    err_thick = np.abs(sub['errbed@BedMachine'].values)
    e_th = 200 * err_thick * vel * 917 / 1E12
    err_sector.loc[s] = [np.sum(D), np.sum(e_th), np.round(np.sum(e_th),10)/np.round(np.sum(D),10)*100]

err_sector.loc['GIS'] = np.sum(err_sector, axis=0)
err_sector.loc['GIS']['E%'] = err_sector.loc['GIS']['E']/err_sector.loc['GIS']['D']*100

err_sector.to_csv('./tmp/err_sector_mouginot.csv')

err_sector.rename(columns = {'D':'D [Gt]',
                             'E':'Error [Gt]',
                             'E%':'Error [%]'}, inplace=True)

err_sector
#+END_SRC

#+RESULTS:
| Sector |      D [Gt] | Error [Gt] | Error [%] |
|--------+-------------+------------+-----------|
|      1 |     1.13636 |   0.115502 |   10.1642 |
|      2 |    0.908778 |   0.193401 |   21.2815 |
|      3 |     11.4881 |   0.824422 |    7.1763 |
|      4 |     2.91582 |   0.304107 |   10.4296 |
|      6 |     10.8265 |   0.919606 |   8.49401 |
|      7 |     0.89246 |  0.0744315 |   8.34004 |
|      8 |    0.648552 |  0.0401655 |    6.1931 |
|      9 |     11.2917 |   0.627721 |   5.55913 |
|     10 |     2.16995 |   0.123117 |   5.67372 |
|     14 |     2.48669 |   0.199724 |   8.03172 |
|     15 |     1.06562 |   0.294537 |     27.64 |
|     16 |     5.45103 |   0.440319 |   8.07772 |
|     19 |    0.270501 |   0.110674 |   40.9145 |
|     20 |    0.767355 |  0.0492437 |   6.41734 |
|     21 |     1.80726 |  0.0974649 |   5.39296 |
|     22 |     1.00093 |  0.0841373 |   8.40591 |
|     23 |    0.895347 |  0.0683989 |   7.63937 |
|     25 |    0.029346 | 0.00512194 |   17.4536 |
|     26 |     1.67654 |  0.0936123 |   5.58367 |
|     27 |     6.05449 |   0.273441 |   4.51633 |
|     28 |    0.805786 |   0.032577 |   4.04289 |
|     29 |     1.96217 |   0.116086 |   5.91621 |
|     30 |     1.83275 |   0.116705 |   6.36774 |
|     31 |    0.422771 |  0.0319242 |   7.55119 |
|     32 |     5.59584 |   0.344155 |   6.15018 |
|     33 |     6.38654 |    0.46026 |   7.20672 |
|     34 |     4.70521 |   0.364038 |   7.73692 |
|     35 |     7.01158 |   0.895814 |   12.7762 |
|     36 |     8.79645 |   0.644694 |   7.32903 |
|     37 |      8.2441 |   0.472339 |   5.72942 |
|     38 |     6.32872 |   0.440766 |   6.96455 |
|     41 |     2.23386 |   0.127442 |     5.705 |
|     42 |    0.803985 |  0.0512305 |   6.37207 |
|     43 |     3.68078 |   0.189515 |   5.14878 |
|     44 |    0.877821 |  0.0481893 |   5.48964 |
|     45 |    0.766472 |  0.0488558 |   6.37412 |
|     47 |     1.41008 |   0.135603 |   9.61666 |
|     48 |     2.50234 |   0.329722 |   13.1765 |
|     49 |    0.966754 |  0.0940565 |    9.7291 |
|     50 |     6.28814 |     0.2806 |   4.46237 |
|     53 |     3.90265 |   0.262703 |   6.73141 |
|     55 |    0.109432 |  0.0276098 |   25.2302 |
|     56 |    0.786596 |   0.154163 |   19.5988 |
|     58 |     11.4567 |   0.688932 |   6.01334 |
|     59 |      15.567 |    1.29056 |   8.29037 |
|     60 |      9.0555 |   0.608475 |   6.71939 |
|     61 |     2.24076 |   0.395304 |   17.6415 |
|     62 |    0.593675 |  0.0322815 |   5.43757 |
|     63 |     30.3913 |    2.99546 |   9.85631 |
|     64 |     5.03947 |   0.422238 |   8.37862 |
|     65 |     3.80811 |  0.0994075 |   2.61042 |
|     67 |    0.202655 |   0.703541 |   347.162 |
|     68 |     3.68474 |  0.0750308 |   2.03626 |
|     69 |     2.22766 |   0.171304 |   7.68986 |
|     70 |    0.650101 |   0.422143 |   64.9349 |
|     72 |     1.10276 |  0.0672873 |   6.10169 |
|     73 |  0.00110613 |   0.188115 |   17006.6 |
|     74 |     4.35112 |   0.399408 |   9.17943 |
|     75 |    0.145543 |    0.04469 |   30.7057 |
|     76 |     1.70487 |   0.239754 |   14.0629 |
|     78 |     2.55006 |   0.109305 |   4.28638 |
|     80 |     7.38191 |   0.550931 |   7.46325 |
|     81 |     6.02572 |   0.468044 |   7.76742 |
|     82 |     1.33453 |   0.122178 |   9.15508 |
|     83 |     4.15658 |   0.507123 |   12.2005 |
|     84 |     1.60693 |   0.176951 |   11.0117 |
|     86 |     6.56638 |     0.6114 |   9.31107 |
|     88 |   0.0161452 |  0.0435953 |    270.02 |
|     93 |     2.04422 |   0.118953 |   5.81902 |
|     94 |     1.18427 |   0.332161 |   28.0477 |
|     95 |     8.83575 |   0.289838 |   3.28029 |
|     96 |     5.06139 |   0.641972 |   12.6837 |
|     97 |  0.00532853 |  0.0315232 |   591.593 |
|     98 |     1.69358 |   0.297288 |   17.5538 |
|     99 | 6.75698e-05 | 0.00849267 |   12568.7 |
|    100 |    0.184706 |   0.121455 |   65.7562 |
|    102 |     23.1246 |    1.23201 |    5.3277 |
|    103 |    0.154002 |  0.0160936 |   10.4503 |
|    104 |     0.49088 |  0.0520854 |   10.6106 |
|    106 |     14.9256 |   0.466246 |    3.1238 |
|    107 |     3.84582 |   0.339018 |   8.81522 |
|    108 |    0.595502 |   0.165221 |   27.7449 |
|    109 |   0.0884075 |   0.042508 |    48.082 |
|    110 |    0.205879 |  0.0211271 |   10.2619 |
|    111 |  0.00582636 |   0.393715 |   6757.48 |
|    113 | 0.000794878 |   0.100536 |     12648 |
|    114 |     1.38749 |   0.120317 |   8.67155 |
|    115 |    0.897201 |    0.20931 |   23.3292 |
|    117 |     6.98255 |   0.525467 |   7.52543 |
|    118 | 0.000957382 |   0.166821 |   17424.7 |
|    120 |    0.412083 |   0.102889 |   24.9682 |
|    121 |     2.25015 |   0.512606 |   22.7809 |
|    122 |   0.0492951 |   0.488022 |   990.001 |
|    124 |  0.00105356 |   0.171178 |   16247.6 |
|    125 |     1.59346 |  0.0753527 |   4.72888 |
|    126 |     2.38866 |   0.209683 |   8.77827 |
|    127 |     9.53131 |   0.556236 |   5.83588 |
|    128 |   0.0029097 |    0.57392 |   19724.4 |
|    134 |     2.85382 |     1.4367 |   50.3433 |
|    135 |   0.0190592 |  0.0324244 |   170.125 |
|    136 |  0.00879623 |   0.102694 |   1167.48 |
|    138 |   0.0996933 |  0.0314422 |    31.539 |
|    139 |      0.2357 |  0.0701601 |   29.7666 |
|    140 |     1.04003 |   0.121997 |   11.7301 |
|    141 |    0.258956 |  0.0561728 |   21.6921 |
|    142 |    0.210307 |  0.0415359 |   19.7501 |
|    146 |    0.513598 |   0.063135 |   12.2927 |
|    147 |     2.90962 |   0.253602 |   8.71601 |
|    148 |      1.2819 |  0.0842873 |   6.57516 |
|    150 |    0.238113 |   0.133588 |   56.1028 |
|    151 |    0.215437 |  0.0542768 |   25.1938 |
|    152 |    0.171266 |  0.0699659 |   40.8523 |
|    153 |    0.280762 |  0.0780211 |   27.7891 |
|    154 |    0.716738 |    0.10592 |   14.7781 |
|    156 |  0.00128292 |    0.22432 |   17485.1 |
|    157 |  0.00904871 |  0.0105535 |    116.63 |
|    158 |    0.321452 |  0.0805232 |   25.0498 |
|    164 |    0.015171 |   0.041483 |   273.437 |
|    167 | 9.52965e-05 |  0.0136362 |   14309.2 |
|    172 | 0.000256998 |  0.0366889 |     14276 |
|    174 |  0.00019268 |  0.0113515 |   5891.37 |
|    183 |    0.179814 |   0.037001 |   20.5774 |
|    185 |    0.398766 |  0.0630249 |    15.805 |
|    189 |       6.042 |   0.308196 |    5.1009 |
|    190 |     4.15765 |     2.0767 |   49.9487 |
|    192 |      4.9286 |   0.459816 |   9.32955 |
|    193 |     1.84566 |  0.0888249 |   4.81264 |
|    195 |    0.218933 |  0.0297228 |   13.5762 |
|    197 |     0.60224 |  0.0508668 |   8.44628 |
|    199 |    0.404987 |    0.49271 |   121.661 |
|    203 |     0.79559 |   0.105298 |   13.2353 |
|    204 |    0.101074 |   0.019955 |    19.743 |
|    207 |     6.56012 |   0.468184 |   7.13683 |
|    208 |     3.20135 |   0.349065 |   10.9037 |
|    209 |     0.78797 |   0.141833 |   17.9998 |
|    210 |    0.571084 |  0.0650242 |   11.3861 |
|    211 |     3.38362 |   0.110959 |    3.2793 |
|    212 |     4.54297 |   0.190982 |   4.20389 |
|    213 |     4.63417 |   0.506259 |   10.9245 |
|    214 |     8.39299 |   0.467779 |   5.57345 |
|    215 |   0.0521331 |  0.0802041 |   153.845 |
|    216 |     0.66763 |  0.0773952 |   11.5925 |
|    218 |     30.7332 |    2.56227 |   8.33713 |
|    219 |    0.403487 |  0.0707834 |   17.5429 |
|    222 |   0.0898964 |  0.0201874 |   22.4563 |
|    223 |     11.3835 |   0.318286 |   2.79603 |
|    224 |    0.465393 |    0.17042 |   36.6184 |
|    231 |    0.930879 |   0.110524 |   11.8731 |
|    232 | 0.000300861 |  0.0524098 |   17419.9 |
|    233 |     4.20433 |    0.28694 |   6.82485 |
|    234 |   0.0192938 | 0.00886986 |   45.9727 |
|    237 |    0.356911 |   0.227127 |   63.6368 |
|    239 |     0.16309 |  0.0146806 |   9.00151 |
|    240 |   0.0723574 | 0.00594069 |    8.2102 |
|    243 |     1.36437 |   0.199452 |   14.6186 |
|    245 |    0.188843 |  0.0451201 |   23.8929 |
|    248 |     8.81223 |   0.406155 |   4.60899 |
|    249 |     1.42356 |   0.132901 |   9.33582 |
|    251 |   0.0292431 |  0.0137256 |   46.9361 |
|    254 |    0.581071 |  0.0951835 |   16.3807 |
|    255 |     1.05098 |   0.115429 |   10.9829 |
|    257 | 7.83737e-05 |  0.0120324 |   15352.6 |
|    258 | 0.000377353 |   0.060194 |   15951.6 |
|    GIS |     476.153 |    44.6966 |   9.38702 |

*** Results (Mouginot 2019 Region)
#+BEGIN_SRC python :results raw drawer :session discharge :display text/org
from uncertainties import unumpy
import pandas as pd
import numpy as np

df = pd.read_csv("./tmp/dat.csv")

err_sector = pd.DataFrame(columns=['D','E', 'E%'])
err_sector.index.name = 'Sector'

sectors = np.unique(df['regions@Mouginot_2019'].values)
for s in sectors:
   sub = df[df['regions@Mouginot_2019'] == s]
   thick = sub['thickness@BedMachine']
   vel = np.abs(sub['vx_baseline@ENVEO'])*sub['gates_x@gates_150_10000'] + np.abs(sub['vy_baseline@ENVEO'])*sub['gates_y@gates_150_10000']
   D = 200  * thick * vel * 917 / 1E12
   err_thick = np.abs(sub['errbed@BedMachine'].values)
   # err_thick[np.where(err_thick < 50)] = 50  # IS THIS REASONABLE? IMPORTANT?
   e_th = 200 * err_thick * vel * 917 / 1E12
   err_sector.loc[s] = [np.sum(D), np.sum(e_th), np.round(np.sum(e_th),10)/np.round(np.sum(D),10)*100]

err_sector.loc['GIS'] = np.sum(err_sector, axis=0)
err_sector.loc['GIS']['E%'] = err_sector.loc['GIS']['E']/err_sector.loc['GIS']['D']*100

err_sector.to_csv('./tmp/err_region_mouginot.csv')

err_sector.rename(columns = {'D':'D [Gt]', 
                         'E':'Error [Gt]',
                         'E%':'Error [%]'}, inplace=True)

err_sector
#+END_SRC

#+RESULTS:
| Sector |    D [Gt] | Error [Gt] | Error [%] |
|--------+-----------+------------+-----------|
|      1 | 0.0732849 | 0.00470999 |   6.42696 |
|      2 | 0.0823817 | 0.00651088 |    7.9033 |
|      3 |  0.210029 |  0.0190811 |   9.08501 |
|      4 |  0.370091 |  0.0407197 |   11.0026 |
|      5 | 0.0546231 | 0.00890458 |   16.3018 |
|      6 |  0.214758 |  0.0164815 |   7.67446 |
|      7 |  0.316332 |  0.0236688 |   7.48227 |
|    GIS |    1.3215 |   0.120077 |   9.08639 |

*** Results (Gate)                                                 :noexport:
#+BEGIN_SRC python :results raw drawer :session discharge :display text/org
from uncertainties import unumpy
import pandas as pd
import numpy as np

df = pd.read_csv("./tmp/dat.csv")

err_gate = pd.DataFrame(columns=['D','E', 'E%'])
err_gate.index.name = 'Gate'

gates = np.unique(df['gates_gateID@gates_150_10000'].values)
for g in gates:
    sub = df[df['gates_gateID@gates_150_10000'] == g]
    thick = sub['thickness@BedMachine']
    vel = np.abs(sub['vx_baseline@ENVEO'])*sub['gates_x@gates_150_10000'] + np.abs(sub['vy_baseline@ENVEO'])*sub['gates_y@gates_150_10000']
    D = 200  * thick * vel * 917 / 1E12
    err_thick = np.abs(sub['errbed@BedMachine'].values)
    # err_thick[np.where(err_thick < 50)] = 50  # IS THIS REASONABLE? IMPORTANT?
    e_th = 200 * err_thick * vel * 917 / 1E12
    err_gate.loc[g] = [np.sum(D), np.sum(e_th), np.sum(e_th)/np.sum(D)*100]

err_gate.loc['GIS'] = np.sum(err_gate, axis=0)
err_gate.loc['GIS']['E%'] = err_gate.loc['GIS']['E']/err_gate.loc['GIS']['D']*100

gate_meta = pd.read_csv("./out/gate_meta.csv")
err_gate['name'] = ''
for g in err_gate.index.values:
    if (g == 'GIS'): continue
    if (sum(gate_meta.gate == g) == 0): continue
    err_gate.loc[g,'name'] = gate_meta[gate_meta.gate == g].Mouginot_2019.values[0]

err_gate.to_csv('./tmp/err_gate.csv')
err_gate.rename(columns = {'D':'D [Gt]', 
                           'E':'Error [Gt]',
                           'E%':'Error [%]'}, inplace=True),

err_gate
#+END_SRC



** Raw data to discharge product
:PROPERTIES:
:header-args:python+: :tangle raw2discharge.py :session raw2discharge
:END:
