code.org
*** Load data

+ What columns are in the file?
+ Don't show all the "vel_eff_YYYY_MM_DD" and "err_eff_YYYY_MM_DD" columns.
#+BEGIN_SRC bash :results verbatim :tangle no
head -n1 ./tmp/dat.csv | tr ',' '\n' | grep -v "vel_eff_*" | grep -v "err_eff_*" | grep -v "dh_*" | sort | uniq | tr '\n' '\t'
echo "also: dh_YYYY@elev, vel_eff_YYYY_MM_DD@various, etc."
#+END_SRC

#+RESULTS:
: bed@BedMachine	err_2D	err_baseline@ENVEO	errbed@BedMachine	gates_gateID@gates_150_10000	gates_x@gates_150_10000	gates_y@gates_150_10000	lat	lon	regions@Mouginot_2019	sectors@Mouginot_2019	sectors@Zwally_2012	surface@BedMachine	thickness@BedMachine	vel_baseline@ENVEO	vel_err_baseline@ENVEO	vx_baseline@ENVEO	vy_baseline@ENVEO	x	y	org_babel_sh_prompt> also: dh_YYYY@elev, vel_eff_YYYY_MM_DD@various, etc.

#+NAME: load_data
#+BEGIN_SRC python :exports none :results raw drawer
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import datetime as dt

# pd.options.display.notebook_repr_html = False

###
### Load metadata
### 
meta_cols = ["x", "y", "err_2D", 
             "regions@Mouginot_2019", "sectors@Zwally_2012", "gates_gateID@gates_150_10000"]
meta = pd.read_csv("./tmp/dat.csv", usecols=meta_cols)
# rename columns
meta.rename(inplace=True, columns={'regions@Mouginot_2019':'regions', 
                                   'sectors@Zwally_2012':'sectors',
                                   'gates_gateID@gates_150_10000':'gates'})
regions = {1:'NO', 2:'NE', 3:'CE', 4:'SE', 5:'SW', 6:'CW', 7:'NW'}
meta['regions'] = meta['regions'].map(regions.get) # Convert sector numbers to meaningful names
meta['ones'] = 1

R = pd.read_csv('./out/gate_meta.csv')
meta['name'] = ''

for g in meta['gates'].unique(): meta.loc[meta['gates'] == g, 'name'] = R[R['gate'] == g]['Mouginot_2019'].values[0]

###
### Load BASELINE velocity
###
vel_baseline = pd.read_csv("./tmp/dat.csv", usecols=['vel_baseline@ENVEO'])
vel_baseline.rename(inplace=True, columns={'vel_baseline@ENVEO':'vel'})

###
### Load all velocity
###
vel = pd.read_csv("./tmp/dat.csv", usecols=(lambda c: (('vel_eff' in c) & ('ENVEO' in c))))

#vel.rename(columns=lambda c: pd.to_datetime(int(c[8:12]), int(c[13:15]), int(c[16:18])), inplace=True)


# Convert column names to datetime
def convert_to_datetime(col_name):
    try:
        year = int(col_name[8:12])
        month = int(col_name[13:15])
        day = int(col_name[16:18])
        return pd.to_datetime(f"{year}-{month:02d}-{day:02d}")
    except Exception as e:
        print(f"Error converting column '{col_name}': {e}")
        return col_name  # Return original column name if conversion fails

vel.rename(columns=lambda c: convert_to_datetime(c), inplace=True)


# vel.drop(columns=pd.datetime(1999, 7, 1), inplace=True) # bad year?
vel.replace(0, np.nan, inplace=True)
# vel = vel.loc[:,vel.columns.year < 2018] # drop 2018
# vel = vel.loc[:,vel.columns.year >= 1985] # drop early years
vel.sort_index(axis='columns', inplace=True)

####################
# Filter Velocity: Rolling Windows
##################
def filter_bad_v(v):
    WINDOW=30
    SIGMA=2
    vel_rolling = v.T.rolling(window=WINDOW, center=True, min_periods=1).mean().T
    vel_residual = v - vel_rolling
    vel_std = vel_residual.T.rolling(window=WINDOW, center=True, min_periods=1).std().T
    vel_outlier = (v > vel_rolling+SIGMA*vel_std) | ( v < vel_rolling-SIGMA*vel_std)
    v[vel_outlier] = np.nan
    return v
####################
# vel = filter_bad_v(vel)
# vel = filter_bad_v(vel)
# vel = filter_bad_v(vel)


vel = vel.interpolate(method='time', axis=1, limit_area='inside')
vel.fillna(method='ffill', axis=1, inplace=True)
vel.fillna(method='bfill', axis=1, inplace=True)


# vel[meta.name == TESTNAME].T.sort_index().head()
# fill[meta.name == TESTNAME].T.sort_index().head()

# vel.sum(axis='rows').resample('1D').mean().interpolate(method='time', limit_area='inside').resample('A').mean()/1E6

###
### Load all velocity ERROR
###
err = pd.read_csv("./tmp/dat.csv", usecols=(lambda c: ('err_eff' in c)))
#err.rename(columns=lambda c: pd.to_datetime(int(c[8:12]), int(c[13:15]), int(c[16:18])), inplace=True)
err.rename(columns=lambda c: convert_to_datetime(c), inplace=True)

err.replace(0, np.nan, inplace=True)
# err = err.loc[:,err.columns.year > 1985] # drop early years
err.sort_index(axis='columns', inplace=True)
# err.interpolate(method='time', limit_area='inside', axis=1 inplace=True)
err.fillna(method='ffill', axis=1, inplace=True)
err.fillna(method='backfill', axis=1, inplace=True)

for c in err.columns[err.columns.duplicated()]:
    err.drop(columns=c, inplace=True)

# make sure we have error (even if 0) for each velocity, and no err w/o vel
for c in vel.columns:
    if c not in err.columns:
        err[c] = np.nan

for c in err.columns:
    if c not in vel.columns:
        err.drop(columns=c, inplace=True)
    
err.sort_index(axis='columns', inplace=True)

# tmp = np.array([c if c not in err.columns else None for c in vel.columns]); print(tmp[tmp != None])

###
### DEM
###
dem = pd.read_csv("./tmp/dat.csv", usecols=(lambda c: ('DEM' in c)))
mv = {}
for c in dem.columns: mv[c] = int(c.split('@')[0].split('_')[1])
dem.rename(inplace=True, columns=mv)


###
### Thickness
###
th = pd.read_csv("./tmp/dat.csv", usecols=["thickness@BedMachine",
                                           "surface@BedMachine",
                                           "bed@BedMachine",
                                           "errbed@BedMachine",
                                           # "bed_0@Millan_2018",
                                           # "thickness_0@Millan_2018",
                                           "gates_gateID@gates_150_10000"])
th.rename(inplace=True, columns={'errbed@BedMachine': 'err',
                                 'gates_gateID@gates_150_10000':'gates'})


th['thick'] = dem[2020] - th['bed@BedMachine']
# th_GIMP = pd.read_csv("./tmp/dat.csv", usecols=(lambda c: ('@GIMP.0715' in c)))
# th_GIMP['day'] = [dt.datetime(2000,1,1) + dt.timedelta(days=np.int(_)) for _ in th_GIMP['day@GIMP.0715']]
# for _ in th_GIMP.columns: th[_] = th_GIMP[_]
# del(th_GIMP)


###
### dh/dt
###
#dhdt = pd.read_csv("./tmp/dat.csv", usecols=(lambda c: ('dh' in c)))
#mv = {}
#for c in dhdt.columns: mv[c] = int(c.split('@')[0].split('_')[1])
#dhdt.rename(inplace=True, columns=mv)

# assume linear trend average of adjacent 3 years for missing years
# dhdt[2018] = dhdt.loc[:,2015:2017].mean(axis='columns')
# dhdt[2019] = dhdt.loc[:,2015:2017].mean(axis='columns')
# dhdt[2018] = 0
# dhdt[2019] = 0

# for y in np.arange(1985,1994+1): dhdt[y] = dhdt.loc[:,1995:1997].mean(axis='columns')
# dhdt.sort_index(axis='columns', inplace=True)

# what is the unadjusted discharge using BedMachine thickness?
D = (vel).apply(lambda c: c * (200 * th['thick'] * meta['err_2D'].values), axis=0) * 917 / 1E12
D_sum = D.sum(axis='rows')#.resample('1D').mean().interpolate(method='time', limit_area='inside').resample('M').mean()

D_sum.to_csv('out/constant_thickness_GIS_D.csv', float_format='%.5f', header=["Discharge [Gt yr-1]"])
#+END_SRC

#+RESULTS: load_data
:results:
None
:end:



*** Adjust thickness 
**** Adjust "bad" thickness
Here we perform a few thickness adjustments:

First, patch in Millan (2018) where it exists.

+ 300 :: All ice <= 20 m thick is assumed bad and set to the minimum
         "good" thickness in a gate if good exists, or 300 m if it
         does not exist
+ 400 :: All ice <= 50 m thick is set to 400 m thick
+ fit :: All ice <= 20 m thick is fit to the log10(thickness) v.
         log10(velocity) relationship, even though it is not a good
         fit.

For testing, gate clumps 9 (all bad) and 546 (some bad)

#+CALL: load_data[:results none]()

#+NAME: adjust_thickness
#+BEGIN_SRC python :exports none :results raw drawer :display text/org
th['bad'] = th['thick'] <= 20

th['thick_adj_300'] = th['thick']
th['thick_adj_300_err'] = th['err']
for g in th[th['bad']]['gates'].unique(): # only work on gates with some (or all) bad thickness
    if all(th[th['gates'] == g]['bad']): # If all bad, set to 300
        th.loc[th['gates'] == g, 'thick_adj_300'] = 300
        th.loc[th['gates'] == g, 'thick_adj_300_err'] = 300/2.

    elif any(th[th['gates'] == g]['bad']): # If any bad, set to minimum of good.
        th.loc[(th['gates'] == g) & (th['bad']), 'thick_adj_300'] = \
        (th.loc[(th['gates'] == g) & (~th['bad']), 'thick']).min()
        th.loc[(th['gates'] == g) & (th['bad']), 'thick_adj_300_err'] = 300/2.

# aggressive: Anything <= 50 gets 400 m thickness
th['thick_adj_400'] = [400 if T <= 50 else T for T in th['thick']]
th['thick_adj_400_err'] = [400/2. if T[0] <= 50 else T[1] for T in zip(th['thick'],th['err'])]
#+END_SRC

#+RESULTS: adjust_thickness
:results:
None
:end:

#+BEGIN_SRC python :exports none :results raw drawer :display text/org :session discharge :tangle no
<<load_data>>
<<adjust_thickness>>

print(th.describe())
#+END_SRC

#+RESULTS:
:results:
None
:end:

#+BEGIN_SRC python :exports none :results raw drawer :display text/org :session discharge
D0 = (vel).apply(lambda c: c * (200 * th['thick'] * meta['err_2D'].values), axis=0) * 917 / 1E12
D1 = (vel).apply(lambda c: c * (200 * th['thick_adj_300'] * meta['err_2D'].values), axis=0) * 917 / 1E12
D0 = D0.sum(axis='rows').resample('1D').mean().interpolate(method='time', limit_area='inside',).resample('A').mean()
D1 = D1.sum(axis='rows').resample('1D').mean().interpolate(method='time', limit_area='inside').resample('A').mean()
pd.concat([D0,D1, D1-D0], axis='columns', keys=['BedMachine','300','diff'])
#+END_SRC

#+RESULTS:
:results:
:end:


**** Adjust thickness w thickness v. velocity fit.

#+NAME: adjust_thickness_fit
#+BEGIN_SRC python :exports none :results raw drawer :display text/plain
CUTOFF = 20
df = vel_baseline.join(th['thick'])
max_vel = df.loc[df['thick'] <= CUTOFF, 'vel'].max() # limit fit to velocities where data is missing
# df = df[(df['thick'] > CUTOFF) & (df['vel'] <= max_vel)]
df = df[df['thick'] > CUTOFF]
# df = df[df['vel'] <= max_vel]

import statsmodels.api as sm
y = (df['thick'])
X = np.log10(df['vel'])
X = sm.add_constant(X)
model = sm.OLS(y, X)
fits = model.fit()
# print(fits.summary())
predictions = fits.predict(X)

from statsmodels.sandbox.regression.predstd import wls_prediction_std
XX = np.linspace(X['vel'].min(), X['vel'].max(), 50)
XX = sm.add_constant(XX)
yy = fits.predict(XX)
sdev, lower, upper = wls_prediction_std(fits, exog=XX, alpha=0.05)

fig = plt.figure(1, figsize=(4,4)) # w,h
# get_current_fig_manager().window.move(0,0)
fig.clf()
# fig.set_tight_layout(True)

ax = fig.add_subplot(111)
im = ax.scatter(X['vel'], y, alpha=0.1, color='k')
xl, yl = ax.get_xlim(), ax.get_ylim()
ax.set_ylabel('Thickness [m]')
ax.set_xlabel('Velocity [m yr$^{-1}$]')
ax.plot(XX[:,1], yy, 'r--')
ax.fill_between(XX[:,1], lower, upper, color='#888888', alpha=0.4)
ax.fill_between(XX[:,1], lower, upper, color='#888888', alpha=0.1)
# ax.set_xlim(50,xl[1])
ax.set_ylim(0,yl[1])
plt.savefig('./tmp/vel_thick_fit.png', transparent=True, bbox_inches='tight', dpi=300)
plt.savefig('./tmp/vel_thick_fit.pdf', transparent=True, bbox_inches='tight', dpi=300)
            
th['fit'] = th['thick']
vel_where_thick_bad = vel_baseline.loc[th['bad'] == True, 'vel']
th.loc[th['bad'] == True, 'fit'] = fits.predict(sm.add_constant(np.log10(vel_where_thick_bad)))
# set err to thickness where fit
th['fit_err'] = th['err']
th.loc[th['bad'] == True, 'fit_err'] = th.loc[th['bad'] == True, 'fit'] /2.


fits.summary()


D0 = (vel).apply(lambda c: c * (200 * th['thick_adj_300'] * meta['err_2D'].values), axis=0) * 917 / 1E12
D1 = (vel).apply(lambda c: c * (200 * th['fit'] * meta['err_2D'].values), axis=0) * 917 / 1E12
D0 = D0.sum(axis='rows').resample('1D').mean().interpolate(method='time', limit_area='inside').resample('A').mean()
D1 = D1.sum(axis='rows').resample('1D').mean().interpolate(method='time', limit_area='inside').resample('A').mean()
pd.concat([D0,D1, D1-D0], axis='columns', keys=['300','fit','diff'])

#+END_SRC

#+RESULTS: adjust_thickness_fit
:results:
                   300         fit      diff
2014-12-31  453.082411  455.289325  2.206914
2015-12-31  461.205239  463.346238  2.140999
2016-12-31  464.891021  467.065868  2.174847
2017-12-31  479.092033  481.519541  2.427507
2018-12-31  477.387607  479.841739  2.454132
2019-12-31  480.346605  482.969111  2.622506
2020-12-31  487.542544  490.261351  2.718807
2021-12-31  489.760421  492.318304  2.557883
2022-12-31  459.334502  461.727055  2.392552
2023-12-31  452.450512  454.749717  2.299205
:end:

**** Table of thickness adjustments
:PROPERTIES:
:ID:       62f5d28c-c704-422d-9e9b-c0771d5b86ee
:END:

#+BEGIN_SRC python :exports none :results raw drawer :display text/org
th[['thick','thick_adj_300','thick_adj_400','fit']].describe()
#+END_SRC

#+RESULTS:
:results:
             thick  thick_adj_300  thick_adj_400          fit
count  7102.000000    7102.000000    7102.000000  7102.000000
mean    509.435354     509.764437     521.827324   515.744227
std     267.498743     266.878764     252.926260   260.992992
min     -66.107367      20.300162      50.147858    20.300162
25%     330.821427     330.821427     361.642470   344.016950
50%     509.002046     509.002046     509.002046   511.645001
75%     676.850565     676.850565     676.850565   676.959312
max    1638.324940    1638.324940    1638.324940  1638.324940
:end:


**** Baseline discharge values for various thickness adjustments
Here we calculate:
+ D_baseline_th_noadj :: Discharge with no thickness adjustment
+ D_baseline_th_300 :: The baseline discharge
+ D_baseline_th_400 :: The discharge assuming the aggressive thickness adjustment
+ D_baseline_th_fit :: The discharge assuming the fitted thickness adjustment
+ D_baseline :: The baseline discharge - picked from our favorite of the above. TBD

#+NAME: discharge_th
#+BEGIN_SRC python :exports none :results raw drawer
D_th = pd.DataFrame(index=th.index,
                    columns=['NoAdj','NoAdj_err','300','300_err','400','400_err','fit','fit_err'])

# + D_baseline_th_noadj :: Discharge with no thickness adjustment
D_th['NoAdj'] = vel_baseline.apply(lambda c: c * (th['thick'].values * 200 * meta['err_2D'].values), axis=0) * 917 / 1E12

# should match HeatMap
D_th['NoMillan'] = vel_baseline.apply(lambda c: c * ((th['surface@BedMachine']-th['bed@BedMachine']).values * 200), axis=0) * 917 / 1E12

# D_baseline_th_noadj_err ::
D_th['NoAdj_err'] = vel_baseline.apply(lambda c: c * (th['err'].values * 200 * meta['err_2D'].values), axis=0) * 917 / 1E12

D_th['300'] = vel_baseline.apply(lambda c: c * (th['thick_adj_300'].values * 200 * meta['err_2D'].values), axis=0) * 917 / 1E12
D_th['300_err'] = vel_baseline.apply(lambda c: c * (th['thick_adj_300_err'].values  * 200 * meta['err_2D'].values), axis=0) * 917 / 1E12

D_th['400'] = vel_baseline.apply(lambda c: c * (th['thick_adj_400'].values * 200 * meta['err_2D'].values), axis=0) * 917 / 1E12
D_th['400_err'] = vel_baseline.apply(lambda c: c * (th['thick_adj_400_err'].values * 200 * meta['err_2D'].values), axis=0) * 917 / 1E12

D_th['fit'] = vel_baseline.apply(lambda c: c * (th['fit'].values * 200 * meta['err_2D'].values), axis=0) * 917 / 1E12
D_th['fit_err'] = vel_baseline.apply(lambda c: c * (th['fit_err'].values* 200 * meta['err_2D'].values), axis=0) * 917 / 1E12

D_th.sum(axis='rows')
#+END_SRC

#+RESULTS: discharge_th
:results:
NoAdj        471.948061
NoAdj_err     37.887958
300          472.091393
300_err       38.495825
400          477.136814
400_err       40.091192
fit          474.933976
fit_err       39.134462
NoMillan     475.807067
dtype: float64
:end:


