code.org
** Distribution for CCI

Example: http://products.esa-icesheets-cci.org/products/details/greenland_iv_50m_s2_20170501_20170914_petermann_v1_1.zip/

It is the optical IV generated by S&T. I believe it follows all the
guidelines listed below.

*GUIDELINES*

1. The *name of the zip file and the name of the top-level folder inside
the zip* file should follow the logic of old products. Please download
the previous version of your product from the CCI website to understand
what this means. For new products, try to follow the structure of the
filename of the example provided in this email.

2. A *quicklook image in .png or .jpg format*. Size can *not exceed*
 1200x1200. This should be contained in the above zip file.

3. A short text file called *description.txt with a brief description of
the product*. The description *can not exceed 100 characters. *This
should also be contained in the above zip file.

4. *A SINGLE text file called README or comments.txt*,  with comments on
the preparation and content of the product . You are encouraged to include
paragraphs "Citable as:" and "References:" if this applies to your
product. This should also be contained in the above zip file.

5. *File permissions.* Inside the zip, files should be 644 (writable to
the owner, readable to everyone, not executable, represented as
"-rw-r--r--"), and directory permissions should be 755 (writable to the
owner, readable and executable to everyone, represented as "drwxr-xr-x").
On a Unix/MacOS/Linux system you list permissions with the command "ls -l",
and correct them with "chmod 644 {filename}" or "chmod 755 {directory}

6. There should not be any spare or hidden files or directories included
in the zip (like e.g. the hidden __MACOS folder you often get when creating
a zipped folder on MacOS).

#+NAME: dist_for_CCI
#+BEGIN_SRC bash :results verbatim
mkdir -p MFID
#+END_SRC

#+RESULTS: dist_for_CCI

#+BEGIN_SRC org :tangle ./MFID/description.txt :mkdirp ./MFID :tangle-mode (identity #o644)
Mass flow rate ice discharge (MFID) for Greenland from CCI IV, CCI SEC, and BedMachine
#+END_SRC

#+BEGIN_SRC org :tangle ./MFID/README.txt :mkdirp ./MFID :tangle-mode (identity #o644)
Mass flow rate ice discharge (MFID) for Greenland ice sheet sectors.

This data set is part of the ESA Greenland Ice sheet CCI project. 
It provides the following CSV files.
1. Mass flow rate ice discharge. Units are Gt yr^{-1}.
2. Mass flow rate ice discharge uncertainty. Units are Gt yr^{-1}.
3. Coverage for each sector at each timestamp. Unitless [0 to 1].

Ice discharge is calculated from the CCI Ice Velocity (IV) product, the CCI Surface Elevation Change (SEC) product (where it overlaps with the ice discharge gates), and ice thickness from BedMachine. Ice discharge gates are placed 10 km upstream from all marine terminating glacier termini that have baseline velocities of more than 150 m/yr. Results are summed by Zwally et al. (2012) sectors.

The methods, including description of "coverage", are described in Mankoff /et al/. (2020; DOI: 10.5194/essd-12-1367-2020)
#+END_SRC

#+BEGIN_SRC python :session MFID :exports results :results raw drawer :kernel sci
import numpy as np
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt

from matplotlib import rc
rc('font', size=12)
rc('text', usetex=False)
# matplotlib.pyplot.xkcd()

# plt.close(1)
fig = plt.figure(1, figsize=(5,4)) # w,h
fig.clf()
fig.set_tight_layout(True)
ax = fig.add_subplot(111)

# Reformat data for CCI
df = pd.read_csv("./out/sector_D.csv", index_col=0, parse_dates=True)\
       .resample('MS')\
       .mean()\
       .to_csv("./MFID/MFID.csv", float_format='%.3f')

df = pd.read_csv("./out/sector_err.csv", index_col=0, parse_dates=True)\
       .resample('MS')\
       .mean()\
       .to_csv("./MFID/MFID_err.csv", float_format='%.3f')

df = pd.read_csv("./out/sector_coverage.csv", index_col=0, parse_dates=True)\
       .resample('MS')\
       .mean()\
       .to_csv("./MFID/coverage.csv", float_format='%.3f')

# Graphic
df = pd.read_csv("./out/sector_D.csv", index_col=0, parse_dates=True)\
       .resample('MS')\
       .mean()\

err = pd.read_csv("./out/sector_err.csv", index_col=0, parse_dates=True)\
        .resample('MS')\
        .mean()\

dsum = df.sum(axis='columns')
errsum = err.sum(axis='columns')
dsum.plot(ax=ax, color='k')
ax.fill_between(dsum.index, dsum-errsum, dsum+errsum, color='grey', alpha=0.25)
ax.set_ylabel("Discharge [Gt yr$^{-1}$]")

plt.savefig('./MFID/MFID.png', transparent=False, bbox_inches='tight')
#+END_SRC

#+RESULTS:
:results:
None
:end:



* Meta                                                  :noexport:
:PROPERTIES:
:header-args: :tangle no
:END:

This document probably uses code - python, octave, and/or R. Below I provide the version of the software(s) used to create this document in order to support the goal of reproduciblity. 
*** Emacs
#+BEGIN_SRC elisp
(emacs-version)
#+END_SRC
#+RESULTS:
: GNU Emacs 30.0.91 (build 2, x86_64-pc-linux-gnu, X toolkit, Xaw scroll bars)
:  of 2024-10-15
*** Org Mode
#+BEGIN_SRC elisp
(org-version nil t)
#+END_SRC
#+RESULTS:
: Org mode version 9.7.11 (release_9.7.11 @ /home/shl/local/emacs/share/emacs/30.0.91/lisp/org/)


* Doc


** ATBD
:PROPERTIES:
:header-args: :tangle no
:END:



*** Accuracy table

The algorithm and data product introduced here are closely related to the algorithm and data product introduced by citet:mankoff_2019_ice.  When comparing annual average over all of Greenland, the this product and the product released by citet:mankoff_2019_ice agree well. 

#+NAME: D_compare_ann
#+BEGIN_SRC jupyter-python :session D_val_text :exports results :results raw drawer :eval no-export :kernel sci :session cci_python
import pandas as pd
import numpy as np
this = pd.read_csv('./MFID/MFID.csv', index_col=0, parse_dates=True)
this_err = pd.read_csv('./MFID/MFID_err.csv', index_col=0, parse_dates=True)

D = pd.DataFrame(index = this.index)
D['this'] = this.sum(axis='columns')
D['this_err'] = this_err.sum(axis='columns')
#D.resample("YS").mean()
D = D.resample('YS').mean()
# root = "/home/kdm/data/Mankoff_2019/d/version_01/"
root = "~/mdrev/projects/promice/solid_ice_discharge/dataverse_data/"
m2019 = pd.read_csv(root+'region_D.csv', index_col=0, parse_dates=True)\
          .resample("YS")\
          .mean()\
          .sum(axis='columns')
m2019_err = pd.read_csv(root+'region_err.csv', index_col=0, parse_dates=True)\
              .resample("YS")\
              .mean()\
              .sum(axis='columns')
m2019.name = "m2019"
m2019_err.name = "m2019_err"

D = D.merge(m2019, left_index=True, right_index=True)
D = D.merge(m2019_err, left_index=True, right_index=True)

D['diff'] = D['this'] - D['m2019']
D['diff %'] = D['diff'] / D['this'] * 100

D.index = D.index.astype(str)
D.to_excel('atbd_accuracy_table.xlsx')
print(D)
#+END_SRC

#+CAPTION: Comparison between this product ("this") and citet:mankoff_2019_ice ("m2019")
#+RESULTS: D_compare_ann
:results:
#+begin_example
                  this   this_err       m2019  m2019_err       diff    diff %
Date                                                                         
2014-01-01  463.344333  36.147667  485.920160  45.105618 -22.575827 -4.872365
2015-01-01  471.203083  36.845167  487.331293  45.268997 -16.128210 -3.422773
2016-01-01  474.222250  37.267583  480.022531  44.705177  -5.800281 -1.223114
2017-01-01  488.726333  38.773583  491.535761  45.785530  -2.809428 -0.574847
2018-01-01  486.879750  38.622667  491.077612  45.832890  -4.197862 -0.862197
2019-01-01  489.644083  38.961333  495.909378  46.209912  -6.265295 -1.279561
2020-01-01  494.285250  39.432250  505.964553  47.229431 -11.679303 -2.362867
2021-01-01  496.105500  39.702250  508.115890  47.590573 -12.010390 -2.420935
2022-01-01  463.078333  36.998583  504.059857  47.232895 -40.981524 -8.849804
2023-01-01  467.146833  37.267667  492.099384  46.327375 -24.952551 -5.341479
#+end_example
:end:

Comparing by regions is difficult because this product is binned on the citet:zwally_2012_sectors and citet:mankoff_2019_ice is on the citet:mouginot_2019_glacier regions and sectors.

*** Regions compare this to PROMICE

#+NAME: fig:discharge_ts_regions
#+BEGIN_SRC python :results raw drawer 
import matplotlib.gridspec as gridspec
import numpy as np
import pandas as pd
from adjust_spines import adjust_spines as adj
import datetime as dt
import matplotlib.pyplot as plt

# plt.close(1)

fig = plt.figure(1, figsize=(9,7)) # w,h
fig.clf()
# fig.set_tight_layout(True)
grid = plt.GridSpec(2, 1, height_ratios=[1,6], hspace=0.1) # h, w

ax_D = fig.add_subplot(111)

from adjust_spines import adjust_spines as adj
adj(ax_D, ['left','bottom'])

D = pd.read_csv("./out/region_D.csv", index_col=0, parse_dates=True)
err = pd.read_csv("./out/region_err.csv", index_col=0, parse_dates=True)

ROOT="/home/shl/mdrev/projects/promice/solid_ice_discharge/dataverse_data"
D_M2019 = pd.read_csv(ROOT+"/region_D.csv", index_col=0, parse_dates=True)
err_M2019 = pd.read_csv(ROOT+"/region_err.csv", index_col=0, parse_dates=True)

D_M2019 = D_M2019[(D_M2019.index > D.index[0]) & (D_M2019.index <= D.index[-1])]
err_M2019 = err_M2019[(err_M2019.index > err.index[0]) & (err_M2019.index <= err.index[-1])]

D = D.loc[D.index[:-3]]
err = err.loc[err.index[:-3]]

# | Color       |   R |   G |   B | hex     |
# |-------------+-----+-----+-----+---------|
# | light blue  | 166 | 206 | 227 | #a6cee3 |
# | dark blue   |  31 | 120 | 180 | #1f78b4 |
# | light green | 178 | 223 | 138 | #b2df8a |
# | dark green  |  51 | 160 |  44 | #33a02c |
# | pink        | 251 | 154 | 153 | #fb9a99 |
# | red         | 227 |  26 |  28 | #e31a1c |
# | pale orange | 253 | 191 | 111 | #fdbf6f |
# | orange      | 255 | 127 |   0 | #ff7f00 |
C1="#e31a1c" # red
C2="#1f78b4" # dark blue



MS=4
Z=99
for r in D.columns:
    e = ax_D.errorbar(D[r].index, D[r].values, mfc='none', ms=MS)
    C = e.lines[0].get_color()
    D[r].plot(drawstyle='steps', linewidth=2, ax=ax_D,
              color=C,
              # color='orange'
              alpha=0.75, zorder=Z)
    D_M2019[r].plot(drawstyle='steps',linestyle = '--', linewidth=2, ax=ax_D,
              color=C,
              # color='orange'
              alpha=0.75, zorder=Z)
    ax_D.fill_between(D.index, 
                      (D[r]-err[r]), 
                      (D[r]+err[r]),
                      color=C,
                      #hatch="\\",
                      alpha=0.25)

    ax_D.fill_between(D_M2019.index,
                      (D_M2019[r]-err_M2019[r]), 
                      (D_M2019[r]+err_M2019[r]),
                      color=C,
                      # hatch="/",
                      alpha=0.1)

    tx = D.iloc[-1].name + dt.timedelta(days=50)
    ty = D.iloc[-1][r]
    if r in ['CE', 'SW']: ty=ty-4
    if r == 'NE': ty=ty+4
    if r == 'NO': ty=ty-2
    ax_D.text(tx, ty, r, verticalalignment='center')

#ax_coverage.set_ylabel('Coverage [%]')
#ax_coverage.set_ylim([0,100])
    
import matplotlib.dates as mdates
ax_D.xaxis.set_major_locator(mdates.YearLocator())

ax_D.legend("", framealpha=0)
ax_D.set_xlabel('Time [Years]')
ax_D.set_ylabel('Discharge [Gt yr$^{-1}$]')
# ax_D.set_yscale('log')

# ax_D.xaxis.set_tick_params(rotation=-90)
# for tick in ax_D.xaxis.get_majorticklabels():
#     tick.set_horizontalalignment("left")
plt.show()
plt.savefig('./figs/discharge_ts_regions.png', transparent=False, bbox_inches='tight', dpi=300)
# plt.savefig('./figs/discharge_ts_regions.pdf', transparent=True, bbox_inches='tight', dpi=300)

# Err_pct = (err_day_year.values/D_day_year.values*100).round().astype(np.int).astype(np.str)
# tbl = (D_day_year.round().astype(np.int).astype(np.str) + ' ('+Err_pct+')')
# tbl.index = tbl.index.year.astype(np.str)
# tbl.columns = [_ + ' (Err %)' for _ in tbl.columns]
# tbl
#+END_SRC
